site/static/logs/baseline-h2/1024/aspnet-minimal.h2load.run1.txt
starting benchmark...
spawning thread #0: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #1: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #2: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #3: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #4: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #5: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #6: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #7: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #8: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #9: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #10: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #11: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #12: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #13: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #14: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #15: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #16: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #17: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #18: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #19: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #20: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #21: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #22: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #23: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #24: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #25: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #26: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #27: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #28: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #29: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #30: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #31: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #32: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #33: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #34: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #35: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #36: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #37: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #38: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #39: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #40: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #41: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #42: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #43: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #44: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #45: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #46: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #47: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #48: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #49: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #50: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #51: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #52: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #53: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #54: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #55: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #56: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #57: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #58: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #59: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #60: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #61: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #62: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
spawning thread #63: 16 total client(s). Timing-based test with 0s of warm-up time and 5s of main duration for measurements.
Warm-up started for thread #46.
Warm-up started for thread #33.
Warm-up started for thread #21.
Warm-up started for thread #62.
Warm-up started for thread #5.
Warm-up started for thread #40.
Warm-up started for thread #23.
Warm-up started for thread #32.
Warm-up started for thread #37.
Warm-up started for thread #12.
Warm-up started for thread #36.
Warm-up started for thread #39.
Warm-up started for thread #34.
Warm-up started for thread #15.
Warm-up started for thread #48.
Warm-up started for thread #4.
Warm-up started for thread #56.
Warm-up started for thread #3.
Warm-up started for thread #49.
Warm-up started for thread #13.
Warm-up started for thread #50.
Warm-up started for thread #52.
Warm-up started for thread #51.
Warm-up started for thread #6.
Warm-up started for thread #47.
Warm-up started for thread #9.
Warm-up started for thread #10.
Warm-up started for thread #27.
Warm-up started for thread #57.
Warm-up started for thread #25.
Warm-up started for thread #63.
Warm-up started for thread #24.
Warm-up started for thread #35.
Warm-up started for thread #30.
Warm-up started for thread #44.
Warm-up started for thread #43.
Warm-up started for thread #42.
Warm-up started for thread #58.
Warm-up started for thread #17.
Warm-up started for thread #61.
Warm-up started for thread #0.
Warm-up started for thread #26.
Warm-up started for thread #38.
Warm-up started for thread #11.
Warm-up started for thread #14.
Warm-up started for thread #55.
Warm-up started for thread #2.
Warm-up started for thread #53.
Warm-up started for thread #8.
Warm-up started for thread #29.
Warm-up started for thread #59.
Warm-up started for thread #19.
Warm-up started for thread #16.
Warm-up started for thread #7.
Warm-up started for thread #60.
Warm-up started for thread #22.
Warm-up started for thread #28.
Warm-up started for thread #18.
Warm-up started for thread #20.
Warm-up started for thread #45.
Warm-up started for thread #41.
Warm-up started for thread #54.
Warm-up started for thread #1.
Warm-up started for thread #31.
Warm-up phase is over for thread #21.
Main benchmark duration is started for thread #21.
progress: 6% of clients started
progress: 12% of clients started
progress: 18% of clients started
progress: 25% of clients started
progress: 31% of clients started
progress: 37% of clients started
Warm-up phase is over for thread #5.
Main benchmark duration is started for thread #5.
progress: 43% of clients started
Warm-up phase is over for thread #23.
Main benchmark duration is started for thread #23.
Warm-up phase is over for thread #33.
Main benchmark duration is started for thread #33.
Warm-up phase is over for thread #32.
Main benchmark duration is started for thread #32.
progress: 50% of clients started
progress: 56% of clients started
Warm-up phase is over for thread #62.
Main benchmark duration is started for thread #62.
Warm-up phase is over for thread #60.
Main benchmark duration is started for thread #60.
Warm-up phase is over for thread #progress: 46.
62Main benchmark duration is started for thread #46.
Warm-up phase is over for thread #6.Warm-up phase is over for thread #
Main benchmark duration is started for thread #6.
28.
Main benchmark duration is started for thread #28.
Warm-up phase is over for thread #41.
Main benchmark duration is started for thread #41.
Warm-up phase is over for thread #15.
Main benchmark duration is started for thread #15.
Warm-up phase is over for thread #9.
Main benchmark duration is started for thread #9.
Warm-up phase is over for thread #43.Warm-up phase is over for thread #
2.
Main benchmark duration is started for thread #43.
Main benchmark duration is started for thread #2.
Warm-up phase is over for thread #24.
Main benchmark duration is started for thread #24.
Warm-up phase is over for thread #40.
Main benchmark duration is started for thread #40.
Warm-up phase is over for thread #1Warm-up phase is over for thread #.27.

Main benchmark duration is started for thread #27.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Warm-up phase is over for thread #39.
Main benchmark duration is started for thread #39.
Warm-up phase is over for thread #Warm-up phase is over for thread #18.
Main benchmark duration is started for thread #18.
Warm-up phase is over for thread #31.
Main benchmark duration is started for thread #31.
Warm-up phase is over for thread #16.
Main benchmark duration is started for thread #16.
Warm-up phase is over for thread #17.
42Main benchmark duration is started for thread #17.
.
Main benchmark duration is started for thread #42.
Warm-up phase is over for thread #44.
Main benchmark duration is started for thread #44.
Warm-up phase is over for thread #38.
Main benchmark duration is started for thread #38.
Warm-up phase is over for thread #7Warm-up phase is over for thread #.
Warm-up phase is over for thread #Warm-up phase is over for thread #Main benchmark duration is started for thread #357.
Warm-up phase is over for thread #.
Warm-up phase is over for thread #14.25Warm-up phase is over for thread #Warm-up phase is over for thread #Warm-up phase is over for thread #
61.
53.
Main benchmark duration is started for thread #10.Main benchmark duration is started for thread #61% of clients started11.Main benchmark duration is started for thread #53.Warm-up phase is over for thread #
35.
Warm-up phase is over for thread #Main benchmark duration is started for thread #Main benchmark duration is started for thread #Warm-up phase is over for thread #..

Warm-up phase is over for thread #Main benchmark duration is started for thread #29Warm-up phase is over for thread #59.
.10.

30Main benchmark duration is started for thread #29.

20Warm-up phase is over for thread #..
25.


52Warm-up phase is over for thread #8.
Main benchmark duration is started for thread #8.
47
Main benchmark duration is started for thread #54Warm-up phase is over for thread #57Main benchmark duration is started for thread #3020.
.
Main benchmark duration is started for thread #54.
Warm-up phase is over for thread #26.
Main benchmark duration is started for thread #26..
Main benchmark duration is started for thread #
.Main benchmark duration is started for thread #
47.Warm-up phase is over for thread #Main benchmark duration is started for thread #57.
11.4
.Warm-up phase is over for thread #12..
.


Main benchmark duration is started for thread #Main benchmark duration is started for thread #59.
1412.
Main benchmark duration is started for thread #52.

Main benchmark duration is started for thread #4.
.
progress: 68% of clients started
progress: 75% of clients started
Warm-up phase is over for thread #56.
Main benchmark duration is started for thread #56.
Warm-up phase is over for thread #45.
Main benchmark duration is started for thread #45.
progress: 81% of clients started
Warm-up phase is over for thread #37.
Main benchmark duration is started for thread #37.
Warm-up phase is over for thread #63.
Main benchmark duration is started for thread #63.
Warm-up phase is over for thread #22.
Main benchmark duration is started for thread #22.
Warm-up phase is over for thread #58.
Main benchmark duration is started for thread #58.
Warm-up phase is over for thread #19.
progress: Main benchmark duration is started for thread #19.
87% of clients started
Warm-up phase is over for thread #13.
Main benchmark duration is started for thread #13.
Warm-up phase is over for thread #51.
Main benchmark duration is started for thread #51.
Warm-up phase is over for thread #34.
Main benchmark duration is started for thread #34.
progress: 93% of clients started
Warm-up phase is over for thread #50.
Main benchmark duration is started for thread #50.
progress: Warm-up phase is over for thread #100% of clients started
55.
Main benchmark duration is started for thread #55.
Warm-up phase is over for thread #49.
Main benchmark duration is started for thread #49.
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #48.
Main benchmark duration is started for thread #48.
Warm-up phase is over for thread #36.
Main benchmark duration is started for thread #36.
TLS Protocol: TLSv1.3
Cipher: TLS_AES_256_GCM_SHA384
Server Temp Key: X25519 253 bits
Application protocol: h2
Main benchmark duration is over for thread #21. Stopping all clients.
Stopped all clients for thread #21
Main benchmark duration is over for thread #23. Stopping all clients.
Stopped all clients for thread #23
Main benchmark duration is over for thread #5. Stopping all clients.
Stopped all clients for thread #5
Main benchmark duration is over for thread #33. Stopping all clients.
Stopped all clients for thread #33
Main benchmark duration is over for thread #32. Stopping all clients.
Stopped all clients for thread #32
Main benchmark duration is over for thread #28. Stopping all clients.
Main benchmark duration is over for thread #6. Stopping all clients.
Stopped all clients for thread #6
Stopped all clients for thread #28
Main benchmark duration is over for thread #9. Stopping all clients.
Stopped all clients for thread #9
Main benchmark duration is over for thread #43. Stopping all clients.
Stopped all clients for thread #43
Main benchmark duration is over for thread #27. Stopping all clients.
Stopped all clients for thread #27
Main benchmark duration is over for thread #15. Stopping all clients.
Stopped all clients for thread #15
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #40. Stopping all clients.
Stopped all clients for thread #40
Main benchmark duration is over for thread #60. Stopping all clients.
Stopped all clients for thread #60
Main benchmark duration is over for thread #16. Stopping all clients.
Stopped all clients for thread #16
Main benchmark duration is over for thread #42. Stopping all clients.
Stopped all clients for thread #42
Main benchmark duration is over for thread #Main benchmark duration is over for thread #44. Stopping all clients.
Stopped all clients for thread #44
Main benchmark duration is over for thread #31. Stopping all clients.
Stopped all clients for thread #31
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3
Main benchmark duration is over for thread #35. Stopping all clients.
Stopped all clients for thread #35
Main benchmark duration is over for thread #38. Stopping all clients.
Main benchmark duration is over for thread #Stopped all clients for thread #3846
. Stopping all clients.
Stopped all clients for thread #46
Main benchmark duration is over for thread #57. Stopping all clients.
Stopped all clients for thread #57
Main benchmark duration is over for thread #2. Stopping all clients.
Main benchmark duration is over for thread #Stopped all clients for thread #242. Stopping all clients.

Stopped all clients for thread #24
Main benchmark duration is over for thread #52. Stopping all clients.
Main benchmark duration is over for thread #62. Stopping all clients.
Stopped all clients for thread #Main benchmark duration is over for thread #Main benchmark duration is over for thread #8. Stopping all clients.26
. Stopping all clients.52Main benchmark duration is over for thread #Stopped all clients for thread #7. Stopping all clients.
8
Stopped all clients for thread #62
Main benchmark duration is over for thread #4. Stopping all clients.
Stopped all clients for thread #4
Main benchmark duration is over for thread #12. Stopping all clients.
Stopped all clients for thread #12
Stopped all clients for thread #7
Main benchmark duration is over for thread #20. Stopping all clients.
Stopped all clients for thread #20
Main benchmark duration is over for thread #47. Stopping all clients.
Stopped all clients for thread #47


Stopped all clients for thread #26
Main benchmark duration is over for thread #41. Stopping all clients.
Stopped all clients for thread #41
Main benchmark duration is over for thread #39. Stopping all clients.
Stopped all clients for thread #39
Main benchmark duration is over for thread #18. Stopping all clients.
Stopped all clients for thread #18
Main benchmark duration is over for thread #14. Stopping all clients.
Stopped all clients for thread #14
Main benchmark duration is over for thread #11. Stopping all clients.
Stopped all clients for thread #11
Main benchmark duration is over for thread #61. Stopping all clients.
Stopped all clients for thread #61
Main benchmark duration is over for thread #53. Stopping all clients.
Stopped all clients for thread #53
Main benchmark duration is over for thread #29. Stopping all clients.
Stopped all clients for thread #29
Main benchmark duration is over for thread #30. Stopping all clients.
Stopped all clients for thread #30
Main benchmark duration is over for thread #17. Stopping all clients.
Stopped all clients for thread #17
Main benchmark duration is over for thread #59. Stopping all clients.
Stopped all clients for thread #59
54. Stopping all clients.
Stopped all clients for thread #54
Main benchmark duration is over for thread #25. Stopping all clients.
Main benchmark duration is over for thread #Stopped all clients for thread #10. Stopping all clients.25

Stopped all clients for thread #10
Main benchmark duration is over for thread #37. Stopping all clients.
Stopped all clients for thread #37
Main benchmark duration is over for thread #34. Stopping all clients.
Stopped all clients for thread #34
Main benchmark duration is over for thread #49. Stopping all clients.
Stopped all clients for thread #49
Main benchmark duration is over for thread #19. Stopping all clients.
Stopped all clients for thread #19
Main benchmark duration is over for thread #13. Stopping all clients.
Main benchmark duration is over for thread #Stopped all clients for thread #4513. Stopping all clients.

Main benchmark duration is over for thread #48. Stopping all clients.
Main benchmark duration is over for thread #63. Stopping all clients.
Main benchmark duration is over for thread #Stopped all clients for thread #63
56. Stopping all clients.
Stopped all clients for thread #56
Stopped all clients for thread #48
Stopped all clients for thread #45
Main benchmark duration is over for thread #58. Stopping all clients.
Stopped all clients for thread #58
Main benchmark duration is over for thread #55. Stopping all clients.
Stopped all clients for thread #55
Main benchmark duration is over for thread #22. Stopping all clients.
Stopped all clients for thread #22
Main benchmark duration is over for thread #36. Stopping all clients.
Stopped all clients for thread #36
Main benchmark duration is over for thread #51. Stopping all clients.
Stopped all clients for thread #51
Main benchmark duration is over for thread #50. Stopping all clients.
Stopped all clients for thread #50
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0

finished in 5.08s, 1200608.40 req/s, 27.54MB/s
requests: 6003042 total, 6035810 started, 6003042 done, 6003042 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 6003042 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 137.68MB (144369224) total, 28.85MB (30253504) headers (space savings 96.21%), 5.72MB (6003042) data
                     min         max         mean         sd        +/- sd
time for request:      208us    310.13ms     32.82ms     32.44ms    89.96%
time for connect:     2.82ms    321.36ms    115.68ms     67.64ms    58.98%
time to 1st byte:     8.20ms    414.21ms    295.23ms    121.44ms    78.81%
req/s           :     991.96     1355.66     1172.17       55.50    67.19%